anachrocomputer/PIC32Reach/PIC32Reach.c
static void SPI3_begin(const int baud)
{    
    SPI3BRG = ((FPBCLK / 2) / baud) - 1;
    SPI3CONbits.MSTEN = 1;  // Master mode
    SPI3CONbits.MODE16 = 0; // 8-bit mode
    SPI3CONbits.MODE32 = 0;
    SPI3CONbits.CKE = 1;
    SPI3CONbits.STXISEL = 0; // Interrupt on Tx complete
    SPI3CONbits.SRXISEL = 3; // Interrupt on Rx full
    
    TRISAbits.TRISA0 = 0;   // RA0 pin 17, P1 pin 24 as output for SS
    LATASET = _LATA_LATA0_MASK;   // De-assert SS for SPI3
    
    IPC12bits.SPI3IP = 1;          // SPI3 interrupt priority 1
    IPC12bits.SPI3IS = 1;          // SPI3 interrupt sub-priority 1
    IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
    IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
    
    SPINbytes = 0;
    SPIDummyReads = 0;
    SPIBuf = NULL;
    
    SPI3CONbits.ON = 1;
}


bool SPIwrite(uint8_t *buf, const int nbytes)
{
    if (SPIDummyReads != 0)     // SPI tranmission still in progress?
    {
        return (false);
    }
    
    if ((nbytes <= 0) || (buf == NULL))
    {
        return (false);
    }
    
    LATACLR = _LATA_LATA0_MASK;   // Assert SS for SPI3
    
    SPIBuf = buf;
    SPINbytes = nbytes;
    SPIDummyReads = nbytes;
    
    SPI3BUF = *SPIBuf++;          // Transmit first byte
    SPINbytes--;
    
    IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
    IEC2SET = _IEC2_SPI3RXIE_MASK;  // Enable SPI3 Rx interrupt
    
    if (SPINbytes > 0)
    {
        IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
        IEC2SET = _IEC2_SPI3TXIE_MASK;  // Enable SPI3 Tx interrupt
    }
    
    return (true);
}

int SPIbytesPending(void)
{
    return (SPIDummyReads);
}


static void I2C1_begin(const int speed)
{
    // TODO: base these numbers on FPBCLK
    if (speed > 200)
    {
        I2C1BRG = 0x2c;     // 400kHz
    }
    else
    {
        I2C1BRG = 0xc2;     // 100kHz
    }
    
    I2C1CONSET = _I2C1CON_ON_MASK;  // Enable I2C1
}


/* I2C1_Start --- send a Start condition and wait for completion */

static void I2C1_Start(void)
{
    I2C1CONSET = _I2C1CON_SEN_MASK; // Initiate start condition

    while (I2C1CONbits.SEN != 0)
        ;
}


/* I2C1_RepeatStart --- send a Repeated Start condition and wait for completion */

static void I2C1_RepeatStart(void)
{
    I2C1CONSET = _I2C1CON_RSEN_MASK; // Initiate repeated start condition

    while (I2C1CONbits.RSEN != 0)
        ;
}


/* I2C1_Transmit --- transmit a byte and wait for completion */

static void I2C1_Transmit(const uint8_t txByte)
{
    I2C1TRN = txByte;               // Transmit one byte

    while (I2C1STATbits.TRSTAT)
        ;
}


/* I2C1_Stop --- send a Stop condition and wait for completion */

static void I2C1_Stop(void)
{
    I2C1CONSET = _I2C1CON_PEN_MASK; // Initiate stop condition

    while (I2C1CONbits.PEN != 0)
        ;
}


/* I2C1_Recover --- recover from a bus collision error by clocking 9 times */

static void I2C1_Recover(void)
{
    int i;
    
    I2C1CONCLR = _I2C1CON_ON_MASK;  // Disable I2C1
    
    TRISAbits.TRISA14 = 1;  // Set SCL1 to input
    TRISAbits.TRISA15 = 1;  // Set SDA1 to input
    
    dally(20);
    
    for (i = 0; i < 9; i++)
    {
        LATAbits.LATA14 = 0;
        TRISAbits.TRISA14 = 0;  // Set SCL1 to output, pulling LOW
        
        dally(12);
        
        LATAbits.LATA14 = 1;    // Allow SCL1 to float HIGH again
        
        dally(12);
    }
    
    dally(10);
    
    I2C1CONSET = _I2C1CON_ON_MASK;  // Re-enable I2C1
    
    dally(10);
    
    I2C1_Stop();
}


/* I2C1_DevicePoll --- poll the I2C bus for a device at a given address */

static bool I2C1_DevicePoll(const uint8_t addr)
{
    bool found;

//    UART4TxByte('[');
//    UART4TxByte('S');
    
    I2C1_Start();
    
//    UART4TxByte('T');

    I2C1_Transmit(addr | 0x01); // Use I2C read address, D0 = 1

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        found = false;
    }
    else
    {
        found = true;
    }

//    UART4TxByte('P');
    
    I2C1_Stop();

    if (I2C1STATbits.BCL)   // Check for bus collision, which seems to happen
    {                       // at this point with the IMU, for unknown reasons
//        UART4TxByte('C');
        I2C1_Recover();
        return (found);
    }

//    UART4TxByte(']');
    
    return (found);
}


/* I2C1_ReadIMU --- read ID register in MPU9250 IMU via I2C */

static uint8_t I2C1_ReadIMU(const uint8_t i2cAddr, const uint8_t regAddr, const int nBytes, uint8_t buf[])
{
    int i;

    I2C1_Start();

    I2C1_Transmit(i2cAddr & 0xfe);    // IMU write address

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        I2C1_Stop();
        return (0);
    }

    I2C1_Transmit(regAddr);  // MPU9250 register address

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        I2C1_Stop();
        return (0);
    }

    I2C1_RepeatStart();

    I2C1_Transmit(i2cAddr | 0x01);    // IMU read address

    if (I2C1STATbits.ACKSTAT)   // ACKSTAT == 1 => NACK
    {
        I2C1_Stop();
        return (0);
    }

    for (i = 0; i < nBytes; i++)
    {
        I2C1CONSET = _I2C1CON_RCEN_MASK; // Initiate receive mode

        while (I2C1STATbits.RBF == 0)
            ;

        buf[i] = I2C1RCV;

        if (i < (nBytes - 1))
        {
            I2C1CONbits.ACKDT = 0;  // Send ACK
        }
        else
        {
            I2C1CONbits.ACKDT = 1;  // Send NACK because this is the last byte to read
        }

        I2C1CONSET = _I2C1CON_ACKEN_MASK; // Send master ACK bit

        while (I2C1CONbits.ACKEN != 0)
            ;
    }

    I2C1_Stop();
    
    if (I2C1STATbits.BCL)   // Check for bus collision, which seems to happen
    {                       // at this point with the IMU, for unknown reasons
//        UART4TxByte('C');
        I2C1_Recover();
        return (nBytes);
    }
    
    return (nBytes);
}


/* I2C1_EERead --- read CAT24C256 EEPROM via I2C */

static int I2C1_EERead(const uint8_t i2cAddr, const uint16_t byteAddr, const int nBytes, uint8_t buf[])
{
    int i;
    
