anachrocomputer/PIC32Reach/PIC32Reach.c
    OC2CONbits.OCTSEL = 0;      // Source: Timer 2
    OC2CONbits.OCM = 6;         // PWM mode
    
    OC2RS = 0;                  // Silent
    
    OC2CONbits.ON = 1;          // Enable OC2 PWM
}


/* initPWM --- set up a timer for PWM generation */

static void initPWM(void)
{
    // Configure Timer 3 for 10-bit PWM
    T3CONbits.TCKPS = 6;        // Timer 3 prescale: 64
    
    TMR3 = 0x00;                // Clear Timer 3 counter
    PR3 = 1023;                 // PWM range 0..1023 (10 bits)
    
    T3CONbits.ON = 1;           // Enable Timer 3
    
    OC1CONbits.OCTSEL = 1;      // Source: Timer 3
    OC1CONbits.OCM = 6;         // PWM mode
    
    OC1RS = 256;
    
    OC1CONbits.ON = 1;          // Enable OC1 PWM
}


/* initMillisecondTimer --- set up a timer to interrupt every millisecond */

static void initMillisecondTimer(void)
{
    /* Configure Timer 1 for 1kHz/1ms interrupts */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = (FPBCLK / 1000) - 1;  // Interrupt every millisecond (1kHz)
    
    IPC1bits.T1IP = 6;          // Timer 1 interrupt priority 6
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    T1CONSET = _T1CON_ON_MASK;  // Enable Timer 1
}


/* initSampleTimer --- set up a timer to interrupt at 44100Hz */

static void initSampleTimer(void)
{
    // Set up Timer4 for regular 44.1kHz interrupt
    T4CONbits.TCKPS = 0;        // Timer 4 prescale: 1
    
    TMR4 = 0x00;                // Clear Timer 4 counter
    PR4 = (FPBCLK / 44100) - 1; // Interrupt at 44100Hz
    
    IPC4bits.T4IP = 7;          // Timer 4 interrupt priority 7 (highest)
    IPC4bits.T4IS = 1;          // Timer 4 interrupt sub-priority 1
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    T4CONbits.ON = 1;           // Enable Timer 4
}


void main(void)
{
    static uint8_t spi[32] = {1, 2, 3, 4, 5, 6, 7, 8};
    static uint8_t hello[] = "Hello, world\r\n";
    uint8_t eebuf[256];
    uint8_t imubuf[32];
    char buf[32];
    int i;
    uint16_t ana;
    uint8_t ch;
    
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers */
    TRIS_begin();
    
    LATBbits.LATB15 = 0;  // HV_EN pin 44 LOW (6V regulator OFF)
    
    /* Switch off the MOSFETs */
    LATGbits.LATG15 = 0;  // U1EN pin 1 OFF
    LATEbits.LATE2 = 0;   // U2EN pin 98 OFF
    LATGbits.LATG12 = 0;  // U3EN pin 96 OFF
    LATDbits.LATD13 = 0;  // U4EN pin 80 OFF
    LATDbits.LATD11 = 0;  // U5EN pin 71 OFF
    
    UART1_begin(19200);
    UART2_begin(9600);
    UART3_begin(4800);
    UART4_begin(9600);
    UART5_begin(9600);

    ADC_begin();
    
    I2C1_begin(100);
    
    SPI2_begin(2000000);
    SPI3_begin(1000000);
    
    initTone();
    initPWM();
    initMillisecondTimer();
    initSampleTimer();
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    __builtin_enable_interrupts();  // Global interrupt enable
    
    puts("\nPIC32blinky");
    
    printf("DEVCFG0 = %08x\n", DEVCFG0);
    printf("DEVCFG1 = %08x\n", DEVCFG1);
    printf("DEVCFG2 = %08x\n", DEVCFG2);
    printf("DEVCFG3 = %08x\n", DEVCFG3);
    
    printf("DEVCFG3.USERID = %x\n", DEVCFG3bits.USERID);
    
    printf("DEVID = %x, VER = %x\n", DEVIDbits.DEVID, DEVIDbits.VER);
    switch (DEVIDbits.DEVID)
    {
    case 0x06A13053:
        puts("PIC32MX250F256L");
        break;
    case 0x06A33053:
        puts("PIC32MX270F512L");
        break;
    case 0x06A15053:
        puts("PIC32MX550F256L");
        break;
    case 0x06A35053:
        puts("PIC32MX570F512L");
        break;
    }
    
    while (1)
    {
        U1TXREG = 'A';
        
        LED1 = 0;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        if (I2C1_DevicePoll(0xA0) == false)  // A0, A2 and D0 will ACK
        {
            LED5 = 0;
        }
        
        SPIword = 0x0000;
        OC1RS = 0;
        toneT2(440);
        SPIwrite(spi, 1);
        
        while (SPIbytesPending() > 0)
            ;
        
        SPIwrite(spi, 2);
        
        while (SPIbytesPending() > 0)
            ;
        
        SPIwrite(spi, 3);
        
        while (SPIbytesPending() > 0)
            ;
        
        SPIwrite(spi, 4);
        
        while (SPIbytesPending() > 0)
            ;
        
        SPIwrite(spi, 5);
        
        delayms(500);
        
        ana = analogRead(6);
        
        if (UART4RxAvailable())
        {
            ch = UART4RxByte();
        }
        else
        {
            ch = '*';
        }
        
        sprintf(buf, "%dms %d %c\r\n", millis(), ana, ch);
        
        for (i = 0; buf[i] != '\0'; i++)
        {
            t1ou2(buf[i]);
        }
        
        LED1 = 1;
        LED2 = 0;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        if (I2C1_DevicePoll(0xA2) == false)  // A0, A2 and D0 will ACK
        {
            LED5 = 0;
        }
        
        SPIword = 0xAA55;
        OC1RS = 128;
        toneT2(0);
        SPIwrite(spi, 8);
        
        delayms(500);
        
        U3TXREG = 'C';
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 0;
        LED4 = 1;
        LED5 = 1;
        
        if (I2C1_DevicePoll(0xD0) == false)  // A0, A2 and D0 will ACK
        {
            LED5 = 0;
        }
        
        SPIword = 0x55AA;
        OC1RS = 256;
        toneT2(880);
        SPIwrite(hello, sizeof (hello) - 1);
        
        delayms(500);
        
        printf("%X", 0xDEADBEEF);
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 1;
        LED4 = 0;
        LED5 = 1;
        
        I2C1_EERead(0xA0, 0, 16, eebuf);
        
        SPIword = 0xFF00;
        OC1RS = 512;
        toneT2(0);
        
        delayms(500);
        
        U5TXREG = 'E';
        
        LED1 = 1;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 0;
        
        //I2C1_EERead(0xA2, 0, 16, eebuf);
        if ((I2C1_ReadIMU(0xD0, 117, 1, imubuf) == 1) && (imubuf[0] == 0x71))
        {
            fputs("[I]", stdout);
        }
        else
        {
            fputs("[?]", stdout);
        }
        
        SPIword = 0xFF00;
        OC1RS = 1023;
        toneT2(440 * 8);
        
        delayms(500);
    }
}

